#  Пользователь вводит строку текста.
# ✔ Подсчитайте сколько раз встречается
# каждая буква в строке без использования
# метода count и с ним.
# ✔ Результат сохраните в словаре, где ключ —
# символ, а значение — частота встречи
# символа в строке.
# ✔ Обратите внимание на порядок ключей.
# Объясните почему они совпадают
# или не совпадают в ваших решениях.

user_string = 'asdasdasdasdff fdsggs sdafg'
result = dict()
for i in user_string:
    result[i] = result.get(i, 0) + 1
print(result)