# Создайте в переменной data список значений разных типов перечислив их
# через запятую внутри квадратных скобок. Для каждого элемента в цикле
# выведите:
# ✔порядковый номер начиная с единицы
# ✔значение
# ✔адрес в памяти
# ✔размер в памяти
# ✔хэш объекта
# ✔результат проверки на целое число только если он положительный
# ✔результат проверки на строку только если он положительный
# Добавьте в список повторяющиеся элементы и сравните на результаты.

data = [1, 'sda', 1.45, True]

for i in range(len(data)):
    print(f'index {i}\n'
          f'Значение {data[i]}\n'
          f'Адрес {id(data[i])}\n'
          f'Размер {data[i].__sizeof__()}\n'
          f'Хэш {hash(data[i])}\n'
          f'{"Это число" if isinstance(data[i], int | float) else "Не число"}\n'
          f'{"Это строка" if isinstance(data[i], str) else "Не число"}\n'
          f'{ "="*10} \n')
