# Напишите функцию, которая принимает строку текста.
# Вывести функцией каждое слово с новой строки.
# ✔ Строки нумеруются начиная с единицы.
# ✔ Слова выводятся отсортированными согласно кодировки Unicode.
# ✔ Текст выравнивается по правому краю так, чтобы у самого
# длинного слова был один пробел между ним и номером строки.

def text_print(text):
    my_list = text.split(' ')
    for i, e in enumerate(sorted(my_list, reverse=True, key=len)):
        print(f'{i}. {e}')

text_print('Тут будет текст, который выведется в результате')