# ✔ Функция принимает на вход три списка одинаковой длины:
# ✔ имена str,
# ✔ ставка int,
# ✔ премия str с указанием процентов вида «10.25%».
# ✔ Вернуть словарь с именем в качестве ключа и суммой
# премии в качестве значения.
# ✔ Сумма рассчитывается как ставка умноженная на процент премии.

def prem(a, b, c):
    return {a[i]: b[i]*(round(float(c[i].strip(' % '))))/100 for i in range(len(a))}



result = prem(('Колян', 'Настюха', 'Константин Николаевич'), (45000, 50000, 10500), ('10.25%', '50%', '100%'))
print(result)